;Place localized text in this file

[TheShocktrooperClass X2SoldierClassTemplate]
+DisplayName="Shocktrooper"
+ClassSummary="Shock the enemy and take his life."
+LeftAbilityTreeTitle="Basterd"
+RightAbilityTreeTitle="Commando"

[ShocktrooperFrenzy X2AbilityTemplate]
LocFriendlyName="Combat Frenzy"
LocLongDescription="While suffering wounds, this units hits become more and more critical."
LocHelpText="+5 Crit Damage for each HP missing."
LocFlyOverText="Combat Frenzy"
LocPromotionPopupText="<Bullet/>This unit is going nuts. +5 Crit damage for each HP missing.<br/>"

; ***** Range *****

[IW_ChainRifle X2WeaponTemplate]
FriendlyName="Chain Rifle";
FriendlyNamePlural="Chain Rifles";
BriefSummary="The Chain Rifle uses a length of chain as ammunition, firing it as a cone of red-hot shrapnel via an electric mechanism. It was developed to arm untrained militias in Third World campaigns. A Chain Rifle's wide firing arc makes it devastating at short ranges, where missing is almost impossible. The low production cost and deadly effectiveness of this weapon made it a resounding success in conflicts all over the Human Sphere.";
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> ";

[IW_LightShotgun_CV X2WeaponTemplate]
FriendlyName="Light Shotgun"
BriefSummary="Shotguns fire flechette ammunition, high-caliber shells filled with small, aerodynamic, pointed projectiles with sharp fins. The design of the flechettes makes them rotate during flight, stabilizing their trajectory, and inside the body, maximizing internal damage and hydrostatic shock. Modern shotguns have laser-aided target selectors that feed the data to the chambered shell. The shell has a rudimentary proximity detector that makes it detonate at a given distance from its target, saturating the area with flechettes. Shotgun shells are heavy, making full-auto shotguns impractical, but their reliability and stopping power at short range has made them the weapon of choice for many soldiers likely to enter close-quarters combat."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_BoardingShotgun_CV X2WeaponTemplate]
FriendlyName="Boarding Shotgun"
BriefSummary="The Boarding Shotgun was developed according to specs defined by naval assault units, who needed a close-quarters firearm capable of working reliably in thin-atmosphere environment and even in a vacuum. However, the design of the Boarding Shotgun was also aimed at making use of the qualities of the different types of projectiles that these weapons can fire. The final result was a versatile weapon capable of firing flechette rounds like a Light Shotgun, useful in assault and close combat situations, and high-powered slugs capable of penetrating the protection of armored combatants. A Boarding Shotgun is the ultimate tool to end any confrontation in a definitive way."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_HeavyShotgun_CV X2WeaponTemplate]
FriendlyName="Heavy Shotgun"
BriefSummary="Heavy Shotguns are a primarily vehicle-mounted alternative to Boarding Shotguns. They are heavyweight, high-caliber weapons classified as portable artillery. Heavy Shotguns are typically found on support vehicles, but can sometimes be seen in the hands of troops with exceptional strength or servosystems capable of withstanding the extreme recoil of these weapons."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_Rifle_CV X2WeaponTemplate]
FriendlyName="Rifle"
BriefSummary="The rifle is the inseparable companion of the infantry soldier: conceived for mass combat, it is now the most common weapon in the battlefields of the Sphere. Recent technological advances have made it more lightweight and accurate, making it viable for covert operatives."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_CombiRifle_MG X2WeaponTemplate]
FriendlyName="Combi Rifle"
BriefSummary="The Combi Rifle is a lightweight, easy to handle firearm, perfect for the dynamic demands of a modern warfare environment. Its design maximizes recoil suppression and aim optimization, giving it excellent accuracy both at close and medium ranges."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> A more modern variant of the Rifle, this weapon is less cumbersome and more accurate at close ranges"

[IW_PlasmaRifle X2WeaponTemplate]
FriendlyName="Plasma Rifle"
BriefSummary="The Plasma Rifle is the best example of the quality and the level of sophistication of VoodooTech, the high technology of the Ur Rationalists. Human scientists study and analyze these guns tirelessly, hoping to crack the secrets of their mechanisms to reproduce them with human technology. Members of very select special forces are occasionally allowed to use weapons captured from the enemy, so it is conceivable that some human troops would use these Rifles for black ops. Plasma Rifles are valuable loot for any soldier able to get their hands on one, and they have been known to fetch very high prices in clandestine scientific operations and the black market of weapons."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> The Plasma Rifle possesses two different Shooting Modes from which players can choose"

[IW_Spitfire_MG X2WeaponTemplate]
FriendlyName="Spitfire"
BriefSummary="The Spitfire is a mid-range machine gun designed for close quarters and urban combat. Regardless of its specific incarnation, this type of weapon has carved its way into the history of weapons due to its high fire rate and notable accuracy. Internationally known by different iterations of the name "Fire Spitter", it is widely regarded as the 'most effective automatic firearm in the Sphere'. Compared to its big sister, the Heavy Machine Gun, a Spitfire barrel is shorter and its ammunition lighter, two factors that define its usefulness as assault and support weapon in urban combat environments. Coupled with its sturdy build and ease of use, the Spitfire has all the features of a legendary weapon."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> Has increased damage and can supress enemies\n<Bullet/> Has improved aim on mid range and reduced aim on long range"

[IW_HeavyMachineGun_CV X2WeaponTemplate]
FriendlyName="Heavy Machine Gun"
BriefSummary="Considered by some to be the "mother of all support weapons", the range, destructive power and high rate of fire of the HMG makes it a force to be reckoned with on any battlefield."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_SniperRifle_CV X2WeaponTemplate]
FriendlyName="Sniper Rifle"
BriefSummary="Sniper Rifles are precision weapons with such long-range accuracy that they can dominate an entire battlefield. A well-placed marksman armed with one of these weapons can potentially deter the advance of a whole army."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_SniperRifle_Smart X2WeaponTemplate]
FriendlyName="Smart Sniper Rifle"
BriefSummary="This weapon allows its user the ability to choose between three different Shooting Modes on the fly: the usual of Medium MULTI Special Ammunitions and also another which applies the Guided and the Impact Template (Circular) Traits but with a lower Damage value."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> "

[IW_SniperRifle_Plasma X2WeaponTemplate]
FriendlyName="Plasma Sniper Rifle"
BriefSummary="Perhaps the most fearsome addition to the Plasma family, this long-range Sniper Rifle has been seen covering the battlefields of Paradiso with high-powered Plasma blasts, much to the dismay of human troops. Plasma Sniper Rifles blend the accuracy of other sniper weapons with the strongest power of any Plasma weapon in use by the Combined Army. This weapon is a clear example of the superiority of VoodooTech arms, which Humanity can only aspire to imitate, and that only if they can reverse-engineer its workings first."
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> Target must resist with Armor and Bio-Tech-Shield\n<Bullet/> Blast Mode might hit mulitple foes\ny<Bullet/> Hit mode has increased critical damage"

; ***** Support *****

[IW_LightGrenadeLauncher X2WeaponTemplate]
FriendlyName="Light Grenade Launcher";
FriendlyNamePlural="Light Grenade Launchers";
BriefSummary="Grenade Launchers give soldiers the power to bombard enemy positions with grenades while standing safely outside their direct line of fire. They are particularly useful against tight groups of enemies and as a way to cover the advance of friendly troops.";
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> ";

[IW_HeavyGrenadeLauncher X2WeaponTemplate]
FriendlyName="Heavy Grenade Launcher";
FriendlyNamePlural="Heavy Grenade Launchers";
BriefSummary="The added weight and size of Heavy GL projectiles make these support weapons too cumbersome for foot soldiers. They are conceived as mobile artillery guns, and mounted on TAGs, vehicles and support Remotes, or carried by units with extreme physical strength.";
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> ";

[IW_AdhesivLauncher X2WeaponTemplate]
FriendlyName="Adhesiv Launcher";
BriefSummary="Due to the size of the self-propelled canisters of ultra-rapid setting liquid cement, these weapons are usually loaded via large-bore rotary drum magazines. Adhesive Launchers are most often used as an anti-vehicle weapon, immobilizing enemy vehicles so they can be safely disabled. Adhesive Launchers cannot be used to kill, but they are economical to use and can disable even the most well-armed and armored enemies. TAGs and vehicle drivers have learned to fear the immobilizing goo and what comes next. An accurate shot with an Adhesive Launcher can render the most terrible war machine completely defenseless.";
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> ";

[LightFlamethrowerAttachment X2WeaponUpgradeTemplate]
FriendlyName="Flamethrower"
FriendlyNamePlural="Flamethrowers"
BriefSummary="This wrist-mounted flamethrower relies on a super-pressurized fuel canister and a very focused nozzle to unleash a deadly cone of fire on multiple enemies."
TinySummary="Adds a fragging flame thorerr"
LootTooltip="This weapon upgrade will add a limited use flame thorwer."

; ***** Pistols *****

[IW_Pistol_CV X2WeaponTemplate]
FriendlyName="Pistol";
BriefSummary="Pistols are standard-issue sidearms capable of burst fire. An evolution of civilian-use handguns, almost every soldier carries a Pistol for use in close combat and at point-blank range.";
TacticalText="<Bullet/> Firing the primary weapon always ends the soldier's turn\n<Bullet/> ";

; ***** Melee *****

[IW_Sword X2WeaponTemplate]
FriendlyName="Super sword"
BriefSummary="Fuckshit"
TacticalText="<Bullet/> A more modern variant of the Rifle, this weapon is less cumbersome and more accurate at close ranges"

; ***** Ammunition *****

[ArmorPiercingAmmunition X2AmmoTemplate]
FriendlyName="Armor-Piercing Ammunition"
FriendlyNamePlural="Armor-Piering Ammunitions"
BriefSummary="AP projectiles have one of several different types of anti-armor technology capable of boring through most physical protections like a hot knife through butter. Edged weapons and other melee weapons can be classified as AP if they are used as a deployment system for nanomachines with specific anti-armor capabilities, or if they are manufactured using Teseum, a neomaterial with excellent armor-piercing properties."
TacticalText="<Bullet/> AP Special Ammunition reduces the armor value to half<br/><Bullet/> Does not reduce the armor bonus provided by cover<br/>"

[BreakerAmmunition X2AmmoTemplate]
FriendlyName="Breaker Special Ammunition"
FriendlyNamePlural="Breaker Special Ammunitions"
BriefSummary="Breaker is an umbrella term for a number of types of ammunition designed to pierce the defensive barriers of modern bio-technological shielding (Chemical, Biological, Radiological and Nuclear). The name references the technical expression 'Breakthrough time', a criterion used in the evaluation of CBRN protection that measures the time until the hazardous agent reaches the body. Breaker ammunition can have a variety of different operational mechanisms—nanotechnological, chemical, biological, electromagnetic, etc.—but the design philosophy is always to pierce or degrade the materials that constitute the target's defenses."
TacticalText="<Bullet/> Only halve the BTS value counts against breaker special ammunition<br/><Bullet/> Armor provides its bonus as usual.<br/>"

[DoubleActionAmmunition X2AmmoTemplate]
FriendlyName="Double Action Ammunition"
FriendlyNamePlural="Double Action Ammunitions"
BriefSummary="Double Action ammunition was developed recently in order to cover a military need for lightweight ordnance that maximizes stopping power while remaining compatible with standard-issue infantry weapons."
TacticalText="<Bullet/> Damage is applied twice, including armor.<br/><Bullet/> DA Special Ammunition has a greater chance of damaging the Environment<br/><i>ATTENTION: Use of this Special Ammunition is prohibited by the Concilium Convention. Violators shall be prosecuted by international courts.</i>"

[DoubleTroubleAmmunition X2AmmoTemplate]
FriendlyName="Double Trouble Ammunition"
FriendlyNamePlural="Double Trouble Ammunitions"
BriefSummary="Double Trouble is a very broad descriptive term for a variety of munitions that, using very different technologies, nonetheless have the identical effect of being highly toxic. Due to its increased lethality, DT ammunition is categorized as military-use only. Access to this type of ammunition is nigh-impossible outside the military, and civilian possession is a severe crime everywhere in the Sphere."
TacticalText="<Bullet/> Target suffers from highly potent poison.<br/><Bullet/> <br/><i>ATTENTION: Use of this Special Ammunition is prohibited by the Concilium Convention. Violators shall be prosecuted by international courts.</i>"

[ElectromagneticAmmunition X2AmmoTemplate]
FriendlyName="Electromagnetic Ammunition"
FriendlyNamePlural="Electromagnetic Ammunitions"
BriefSummary="Despite not causing direct physical damage to living organisms, E/M Ammunition is extremely useful against heavier support or offensive units, disabling them and stopping their movement. Electromagnetic pulses are currently one of the most common offensive elements in the realm of electronic warfare. Their potential for disabling electronic and quantronic components is crucial when communications are essential in maximizing the operational effectiveness of infantry soldiers. E/M Ammunition can reduce modern-day hyper-sophisticated enemy soldiers to warriors of antiquity, leaving them stranded from the rest of their combat force."
TacticalText="<Bullet/> Target becomes <i>Isolated</i> and <i>Disabled</i><br/><Bullet/> Heavy Infantry, Tags and Remotes are temporaly <i>Immobilized</i><br/><i>ATTENTION: This Special Ammunition affects Cubes and its use is prohibited by the Concilium Convention. Violators shall be prosecuted by international courts.</i>"

; ARMOR

[IW_MediumConventionalArmor X2ArmorTemplate]
FriendlyName="Conventional Medium Armor"
BriefSummary="Medium Infantry are Special Forces with elite training and equipment, capable of carrying out specialized combat maneuvers."
TacticalText="<Bullet/> A mid-weight armor based on ADVENT salvage.\n<Bullet/> As a medium-class armor, it provides a slot for one additional inventory item."
LocHelpText="Adds ARM & Utiliy at cost of mobility"

